XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_atim.h
#define    ATIM_CR1_CEN_Pos                                       (0U)
#define    ATIM_CR1_CEN_Msk                                       (0x1U << ATIM_CR1_CEN_Pos)
#define    ATIM_CR1_CEN                                           ATIM_CR1_CEN_Msk

#define    ATIM_CR2_MMS2_Pos                                      (20U)
#define    ATIM_CR2_MMS2_Msk                                      (0xfU << ATIM_CR2_MMS2_Pos)
#define    ATIM_CR2_MMS2                                          ATIM_CR2_MMS2_Msk

#define    ATIM_CR2_OISN_Pos                                      (9U)
#define    ATIM_CR2_OISN_Msk                                      (0x1U << ATIM_CR2_OISN_Pos)
#define    ATIM_CR2_OISN                                          ATIM_CR2_OISN_Msk

#define    ATIM_CR2_OIS_Pos                                       (8U)
#define    ATIM_CR2_OIS_Msk                                       (0x1U << ATIM_CR2_OIS_Pos)
#define    ATIM_CR2_OIS                                           ATIM_CR2_OIS_Msk

#define    ATIM_CR2_TI1S_Pos                                      (7U)
#define    ATIM_CR2_TI1S_Msk                                      (0x1U << ATIM_CR2_TI1S_Pos)
#define    ATIM_CR2_TI1S                                          ATIM_CR2_TI1S_Msk

#define    ATIM_CR2_MMS_Pos                                       (4U)
#define    ATIM_CR2_MMS_Msk                                       (0xfU << ATIM_CR2_MMS_Pos)
#define    ATIM_CR2_MMS                                           ATIM_CR2_MMS_Msk

#define    ATIM_CR2_CCDS_Pos                                      (3U)
#define    ATIM_CR2_CCDS_Msk                                      (0x1U << ATIM_CR2_CCDS_Pos)
#define    ATIM_CR2_CCDS                                          ATIM_CR2_CCDS_Msk

#define    ATIM_CR2_CCUS_Pos                                      (2U)
#define    ATIM_CR2_CCUS_Msk                                      (0x1U << ATIM_CR2_CCUS_Pos)
#define    ATIM_CR2_CCUS                                          ATIM_CR2_CCUS_Msk

#define    ATIM_CR2_CCPC_Pos                                      (0U)
#define    ATIM_CR2_CCPC_Msk                                      (0x1U << ATIM_CR2_CCPC_Pos)
#define    ATIM_CR2_CCPC                                          ATIM_CR2_CCPC_Msk

#define    ATIM_SMCR_SMSPS_Pos                                    (25U)
#define    ATIM_SMCR_SMSPS_Msk                                    (0x1U << ATIM_SMCR_SMSPS_Pos)
#define    ATIM_SMCR_SMSPS                                        ATIM_SMCR_SMSPS_Msk

#define    ATIM_SMCR_SMSPE_Pos                                    (24U)
#define    ATIM_SMCR_SMSPE_Msk                                    (0x1U << ATIM_SMCR_SMSPE_Pos)
#define    ATIM_SMCR_SMSPE                                        ATIM_SMCR_SMSPE_Msk

#define    ATIM_SMCR_OCCS_Pos                                     (16U)
#define    ATIM_SMCR_OCCS_Msk                                     (0x1U << ATIM_SMCR_OCCS_Pos)
#define    ATIM_SMCR_OCCS                                         ATIM_SMCR_OCCS_Msk

#define    ATIM_SMCR_ETP_Pos                                      (15U)
#define    ATIM_SMCR_ETP_Msk                                      (0x1U << ATIM_SMCR_ETP_Pos)
#define    ATIM_SMCR_ETP                                          ATIM_SMCR_ETP_Msk

#define    ATIM_SMCR_ECE_Pos                                      (14U)
#define    ATIM_SMCR_ECE_Msk                                      (0x1U << ATIM_SMCR_ECE_Pos)
#define    ATIM_SMCR_ECE                                          ATIM_SMCR_ECE_Msk

#define    ATIM_SMCR_ETPS_Pos                                     (12U)
#define    ATIM_SMCR_ETPS_Msk                                     (0x3U << ATIM_SMCR_ETPS_Pos)
#define    ATIM_SMCR_ETPS                                         ATIM_SMCR_ETPS_Msk

#define    ATIM_SMCR_ETF_Pos                                      (8U)
#define    ATIM_SMCR_ETF_Msk                                      (0xfU << ATIM_SMCR_ETF_Pos)
#define    ATIM_SMCR_ETF                                          ATIM_SMCR_ETF_Msk

#define    ATIM_SMCR_MSM_Pos                                      (7U)
#define    ATIM_SMCR_MSM_Msk                                      (0x1U << ATIM_SMCR_MSM_Pos)
#define    ATIM_SMCR_MSM                                          ATIM_SMCR_MSM_Msk

#define    ATIM_SMCR_TS_Pos                                       (4U)
#define    ATIM_SMCR_TS_Msk                                       (0x1fU << ATIM_SMCR_TS_Pos)
#define    ATIM_SMCR_TS                                           ATIM_SMCR_TS_Msk

#define    ATIM_SMCR_SMS_Pos                                      (0U)
#define    ATIM_SMCR_SMS_Msk                                      (0x7U << ATIM_SMCR_SMS_Pos)
#define    ATIM_SMCR_SMS                                          ATIM_SMCR_SMS_Msk

#define    ATIM_DIER_TERRIE_Pos                                   (23U)
#define    ATIM_DIER_TERRIE_Msk                                   (0x1U << ATIM_DIER_TERRIE_Pos)
#define    ATIM_DIER_TERRIE                                       ATIM_DIER_TERRIE_Msk

#define    ATIM_DIER_IERRIE_Pos                                   (22U)
#define    ATIM_DIER_IERRIE_Msk                                   (0x1U << ATIM_DIER_IERRIE_Pos)
#define    ATIM_DIER_IERRIE                                       ATIM_DIER_IERRIE_Msk

#define    ATIM_DIER_DIRIE_Pos                                    (21U)
#define    ATIM_DIER_DIRIE_Msk                                    (0x1U << ATIM_DIER_DIRIE_Pos)
#define    ATIM_DIER_DIRIE                                        ATIM_DIER_DIRIE_Msk

#define    ATIM_DIER_IDXIE_Pos                                    (20U)
#define    ATIM_DIER_IDXIE_Msk                                    (0x1U << ATIM_DIER_IDXIE_Pos)
#define    ATIM_DIER_IDXIE                                        ATIM_DIER_IDXIE_Msk

#define    ATIM_DIER_CC1BURSTEN_Pos                               (16U)
#define    ATIM_DIER_CC1BURSTEN_Msk                               (0x1U << ATIM_DIER_CC1BURSTEN_Pos)
#define    ATIM_DIER_CC1BURSTEN                                   ATIM_DIER_CC1BURSTEN_Msk

#define    ATIM_DIER_CC2BURSTEN_Pos                               (17U)
#define    ATIM_DIER_CC2BURSTEN_Msk                               (0x1U << ATIM_DIER_CC2BURSTEN_Pos)
#define    ATIM_DIER_CC2BURSTEN                                   ATIM_DIER_CC2BURSTEN_Msk

